* Pi Wake-On-LAN

Use Raspberry Pi to wake up WiFi-connected laptop.

** API

   #+BEGIN_SRC http :pretty
     GET http://127.0.0.1:5000/api/v1/machines
   #+END_SRC

   #+RESULTS:
   #+begin_example
   [
     {
       "name": "tung-mbp",
       "ip": "192.168.1.105",
       "mac": "6c:40:08:8b:4b:02",
       "up": false
     },
     {
       "name": "pi.local",
       "ip": "192.168.1.106",
       "mac": "6c:40:08:8b:4b:02",
       "up": false
     },
     {
       "name": "tung-mbp",
       "ip": "192.168.15.22",
       "mac": "6c:40:08:8b:4b:02",
       "up": true
     }
   ]
   #+end_example

   #+BEGIN_SRC http :pretty
     POST http://127.0.0.1:5000/api/v1/machines
     Content-Type: application/json

     {"name":"tung-mbp","ip":"192.168.15.22","mac":"6c:40:08:8b:4b:02"}
   #+END_SRC

   #+RESULTS:

   #+BEGIN_SRC http :pretty
     DELETE http://127.0.0.1:5000/api/v1/machines/192.168.1.108
   #+END_SRC

   #+RESULTS:
   : []


** LICENSE

   Apache 2
